Cases/1DvalidationConc/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-3;
x1  1;
nx  1;//

y1  10;//
ny  100;

H   1;//
nz  1;//

vertices
(
    (0 0 0)
    ($x1 0 0)
    ($x1 $y1 0)
    (0 $y1 0)
    (0 0 $H)
    ($x1 0 $H)
    ($x1 $y1 $H)
    (0 $y1 $H)   
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    wall_anode
    {
        type wall;//patch;
        faces
        (
            (3 2 6 7)
        );
    }
    wall_cathode
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }

    front
    {
        type empty;//symmetry;//
        faces
        (
            (0 1 2 3)
            (0 3 7 4)
        );
    }
    back
    {
        type empty;//symmetry;//
        faces
        (
            (7 6 5 4)
            (1 5 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
