Cases/1DvalidationConc/0.orig/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//#include "include/controlProperties"

dimensions      [0 0 0 0 0 0 0];// V

internalField   uniform	0;//

boundaryField
{
    "(wall_cathode)"//wall_cathode//       
    {
        type            zeroGradient;
    }
    "(wall_anode)"//wall_cathode//       
    {
        type            fixedValue;
        value		uniform 1;
    }
   
    #include "include/constantPatches"
    
}

// ************************************************************************* //
