Cases/1DvalidationConc/0.orig/include/constantPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

"(front|back)"
{
    type            empty;//symmetry;//
}

    /*"(front|back)"
    {
        type    empty;
    } 
    front
    {
        type    zeroGradient;
    }*/
    


// ************************************************************************* //
