Cases/1DvalidationConc/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;//CrankNicolson 0.5;//
}

gradSchemes
{
    default         Gauss linear;//pointCellsLeastSquares;//leastSquares;//
}

divSchemes
{
    div(rhoPhi,U)   Gauss limitedLinearV 1;//Gauss linear;//Gauss upwind;//limitedLinearV 1;//
    div(phi,C)      Gauss linear;//Gauss upwind;//
    div(phi,alpha)  Gauss vanLeer;//Gauss interfaceCompression;//Gauss linear;//bounded Gauss vanLeer;
    div(phirb,alpha) Gauss interfaceCompression;//Gauss linear;//
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    /*p_rgh;
    pcorr;
    alpha.water;*/
}


// ************************************************************************* //
