Cases/1DvalidationConc/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        /*isoFaceTol      1e-10;
        surfCellTol     1e-6;
        nAlphaBounds    3;
        snapTol         1e-12;
        clip            true;

        nAlphaSubCycles 1;
        cAlpha          1; // Read by interIsoFoam but not used
        reconstructionScheme isoAlpha; // plicRDF*/
            
        

        advectionScheme MULESScheme;//geoAdvection;//isoAdvection;//

        reconstructionScheme isoSurface;//isoAlpha;//gradAlpha;//plicRDF;//


        /*MULESCorr       yes;
        nLimiterIter    10;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;*/
        
        //vof2IsoTol 1e-8;
        //surfCellTol 1e-8;
        //writeVTK true;

        //iso		0.5;//0.5
        //isoFaceTol      1e-16; //1e-8;
        //surfCellTol     1e-16; //1e-8;
        nAlphaBounds    1;//3;
        //snapTol         1e-16;
        clip            true;//false;//

        nAlphaSubCycles 1;//3
        nAlphaCorr      1;//1;
        cAlpha          0;//0;//1;
        writeIsoFaces   true;//false;//
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-06;
        relTol          0;
    }

    "U.*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
      
    "fi.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;//0.5;
    }
    "C.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
        //norm            default;
    }
}

PIMPLE
{
    momentumPredictor no;//yes;//
    nCorrectors       1;
    nNonOrthogonalCorrectors 1;
    correctPhi       no;//yes;//
    
    //pRefPoint     (0 0 0.1);//
    pRefCell	   0; //
    pRefValue      0;
}

relaxationFactors
{
    fields
    {
        p      0.3;
        pFinal   1;
    }
    equations
    {
        "U|k|epsilon"     0.3;
        "(U|k|epsilon)Final"   1;
    }
}



// ************************************************************************* //
