Cases/1DvalidationConc/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

#runApplication -s 1 topoSet -dict system/topoSetDict1
#runApplication -s 1 refineMesh -dict system/refineMeshDict1 -overwrite

#runApplication -s 2 topoSet -dict system/topoSetDict2
#runApplication -s 2 refineMesh -dict system/refineMeshDict2 -overwrite

#runApplication setAlphaField
#runApplication setFields

#runApplication decomposePar
#runParallel $(getApplication)
#runApplication reconstructPar
runApplication $(getApplication)

postProcess -func totalCurrentDensity -noZero # -latestTime #

./extraer.sh

#------------------------------------------------------------------------------
